doc/examples/fluidsimfoam-phill/tests/saved_cases/case0/0/U
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.12 0 0);

boundaryField
{
    outlet
    {
        type            cyclic;
    }

    inlet
    {
        type            cyclic;
    }

    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    top
    {
        type            slip;
    }

    frontandbackplanes
    {
        type            empty;
    }

}
