doc/examples/fluidsimfoam-phill/tests/saved_cases/case0/0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            zeroGradient;
    }

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

    top
    {
        type            zeroGradient;
    }

    frontandbackplanes
    {
        type            empty;
    }
}
