doc/examples/fluidsimfoam-phill/tests/saved_cases/case0/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type        cyclic;
    }

    outlet
    {
        type        cyclic;
    }

    bottom
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    top
    {
        type            zeroGradient;
    }

    frontandbackplanes
    {
        type        empty;
    }
}
