doc/examples/fluidsimfoam-phill/tests/saved_cases/case0/0/rhok
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rhok;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.15;

boundaryField
{
    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    frontandbackplanes
    {
        type            empty;
    }

    outlet
    {
        type            cyclic;
    }

    inlet
    {
        type            cyclic;
    }
}
