doc/examples/fluidsimfoam-phill/tests/saved_cases/case0/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel    Newtonian;

nu            nu  [0 2 -1 0 0 0 0]  0.0001;

Pr            Pr [0 0 0 0 0 0 0]  10;

beta              0.003;

TRef              300;

Prt               0.85;
