doc/examples/fluidsimfoam-phill/tests/saved_cases/case0/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

simulationType    laminar;
