doc/examples/fluidsimfoam-phill/tests/saved_cases/case0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (  0  0  0 )  // 0 v0-0
    (  0.5  0  0 )  // 1 v1-0
    (  1.5  0  0 )  // 2 v2-0
    (  6  0  0 )  // 3 v3-0
    (  0  1  0 )  // 4 v0+y
    (  0.5  1  0 )  // 5 v1+y
    (  1.5  1  0 )  // 6 v2+y
    (  6  1  0 )  // 7 v3+y
    (  0  0  0.01 )  // 8 v7-0
    (  0.5  0  0.01 )  // 9 v6-0
    (  1.5  0  0.01 )  // 10 v5-0
    (  6  0  0.01 )  // 11 v4-0
    (  0  1  0.01 )  // 12 v7+y
    (  0.5  1  0.01 )  // 13 v6+y
    (  1.5  1  0.01 )  // 14 v5+y
    (  6  1  0.01 )  // 15 v4+y
);

blocks
(
    hex (0 1 5 4 8 9 13 12) b0 (20 30 1) simpleGrading (1 ( ( 0.1 0.25 41.9 ) ( 0.9 0.75 1 ) ) 1)  // b0 (v0-0 v1-0 v1+y v0+y v7-0 v6-0 v6+y v7+y)
    hex (1 2 6 5 9 10 14 13) b1 (20 30 1) simpleGrading (1 ( ( 0.1 0.25 41.9 ) ( 0.9 0.75 1 ) ) 1)  // b1 (v1-0 v2-0 v2+y v1+y v6-0 v5-0 v5+y v6+y)
    hex (2 3 7 6 10 11 15 14) b2 (225 30 1) simpleGrading (1 ( ( 0.1 0.25 41.9 ) ( 0.9 0.75 1 ) ) 1)  // b2 (v2-0 v3-0 v3+y v2+y v5-0 v4-0 v4+y v5+y)
);

edges
(
    spline 1 2                      // spline0 (v1-0 v2-0)
    (
         (                0.6             0.0124                  0 )
         (                0.7             0.0395                  0 )
         (                0.8             0.0724                  0 )
         (                0.9              0.132                  0 )
         (                  1              0.172                  0 )
         (                1.1              0.132                  0 )
         (                1.2             0.0724                  0 )
         (                1.3             0.0395                  0 )
         (                1.4             0.0124                  0 )
)
    spline 9 10                      // spline1 (v6-0 v5-0)
    (
         (                0.6             0.0124               0.01 )
         (                0.7             0.0395               0.01 )
         (                0.8             0.0724               0.01 )
         (                0.9              0.132               0.01 )
         (                  1              0.172               0.01 )
         (                1.1              0.132               0.01 )
         (                1.2             0.0724               0.01 )
         (                1.3             0.0395               0.01 )
         (                1.4             0.0124               0.01 )
)
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (5 4 12 13)  // f-b0-n (v1+y v0+y v7+y v6+y)
            (6 5 13 14)  // f-b1-n (v2+y v1+y v6+y v5+y)
            (7 6 14 15)  // f-b2-n (v3+y v2+y v5+y v4+y)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 9 8)  // f-b0-s (v0-0 v1-0 v6-0 v7-0)
            (1 2 10 9)  // f-b1-s (v1-0 v2-0 v5-0 v6-0)
            (2 3 11 10)  // f-b2-s (v2-0 v3-0 v4-0 v5-0)
        );
    }
    outlet
    {
        type cyclic;
        neighbourPatch  inlet;
        faces
        (
            (3 7 15 11)  // f-b2-e (v3-0 v3+y v4+y v4-0)
        );
    }
    inlet
    {
        type cyclic;
        neighbourPatch  outlet;
        faces
        (
            (0 8 12 4)  // f-b0-w (v0-0 v7-0 v7+y v0+y)
        );
    }
    frontandbackplanes
    {
        type empty;
        faces
        (
            (0 4 5 1)  // f-b0-b (v0-0 v0+y v1+y v1-0)
            (1 5 6 2)  // f-b1-b (v1-0 v1+y v2+y v2-0)
            (2 6 7 3)  // f-b2-b (v2-0 v2+y v3+y v3-0)
            (8 9 13 12)  // f-b0-t (v7-0 v6-0 v6+y v7+y)
            (9 10 14 13)  // f-b1-t (v6-0 v5-0 v5+y v6+y)
            (10 11 15 14)  // f-b2-t (v5-0 v4-0 v4+y v5+y)
        );
    }
);

// ************************************************************************* //
