doc/examples/fluidsimfoam-phill/tests/saved_cases/case0/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|rhok|R|T)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|rhok|R|T)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nCorrectors       2;
    pRefCell          0;
    pRefValue         0;
}

relaxationFactors
{
    equations
    {
        ".*"   1.0;
    }
}
