doc/examples/fluidsimfoam-phill/tests/saved_cases/case0/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}

actions
(
    {
        name    rotor;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            p1 (0 0 0);
            p2 (0 0 0.5);
            radius 6.5;
        }
    }
);
